src/cf/InformationRegisters/РезультатыПроверкиКМРазрешительныйРежимМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РезультатыПроверкиКМРазрешительныйРежимМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеРезультата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйКодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДетальныйРезультатПроверкиКМ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументКонтроляКМРазрешительныйРежимМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерУпаковки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерУпаковкиМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/РезультатыПроверкиКМРазрешительныйРежимМДЛП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписатьРезультатыПроверкиКМ(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить(Метаданные.РегистрыСведений.РезультатыПроверкиКМРазрешительныйРежимМДЛП.ПолноеИмя());
		ЭлементБлокировкиДанных.ИсточникДанных = Параметры.ТаблицаРезультатовПроверкиКМ;
		ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("Документ", "Документ");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		ДатаИзменения = ТекущаяДатаСеанса();
		
		ДетальныеСвойстваРезультатаСтрокой = СтрСоединить(ДетальныеСвойстваРезультатаПроверкиКМ(), ",");
		
		Параметры.ТаблицаРезультатовПроверкиКМ.Сортировать("Документ");
		
		ТекущийДокумент = Неопределено;
		Набор = Неопределено;
		Для Каждого Строка Из Параметры.ТаблицаРезультатовПроверкиКМ Цикл
			
			Если ТекущийДокумент <> Строка.Документ Тогда
				ТекущийДокумент = Строка.Документ;
				Если Набор <> Неопределено Тогда
					Набор.Записать();
				КонецЕсли;
				Набор = СоздатьНаборЗаписей();
				Набор.Отбор.Документ.Установить(Строка.Документ);
			КонецЕсли;
			
			Запись = Набор.Добавить();
			Запись.КлючУпаковки  = ИнтеграцияМДЛПКлиентСервер.ПолучитьКлючУпаковки(Строка.НомерУпаковки);
			Запись.ДатаИзменения = ДатаИзменения;
			ЗаполнитьЗначенияСвойств(Запись, Строка);
			Если ЗначениеЗаполнено(Строка.РезультатПроверкиКМ) Тогда
				
				ЗаполнитьЗначенияСвойств(Запись, Строка.РезультатПроверкиКМ);
				
				ДетальныйРезультатПроверкиКМ = Новый Структура(ДетальныеСвойстваРезультатаСтрокой);
				ЗаполнитьЗначенияСвойств(ДетальныйРезультатПроверкиКМ, Строка.РезультатПроверкиКМ);
				
				Запись.ДетальныйРезультатПроверкиКМ = Новый ХранилищеЗначения(Новый ФиксированнаяСтруктура(ДетальныйРезультатПроверкиКМ));
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Набор <> Неопределено Тогда
			Набор.Записать();
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ИмяСобытия = НСтр("ru = 'Проверка КМ разрешительный режим.Запись результатов'", ОбщегоНазначения.КодОсновногоЯзыка());
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Выполняет получение записанных результатов проверки КМ.
//
// Параметры:
//  Параметры - Структура - см. ПараметрыПолученияРезультатовПроверкиКМ.ПараметрыПолученияРезультатовПроверкиКМ.
//
// Возвращаемое значение:
//  ТаблицаРезультатовПроверкиКМ - ТаблицаЗначений - таблица результатов проверки КМ.
//    * НомерУпаковкиПроверки - Строка - номер упаковки.
//    * КлючУпаковкиПроверки - Строка - ключ упаковки.
//    * ДатаИзменения - Дата - дата изменения записи.
//    * РезультатПроверкиКМРазрешительныйРежим - ФиксированнаяСтруктура - результат проверки КМ.
//
Функция ПолучитьРезультатыПроверкиКМ(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НомераУпаковок = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "НомераУпаковок");
	Если ЗначениеЗаполнено(НомераУпаковок) Тогда
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	НомераУпаковок.НомерУпаковки  КАК НомерУпаковки,
		|	НомераУпаковок.КлючУпаковки   КАК КлючУпаковки
		|ПОМЕСТИТЬ НомераУпаковок
		|ИЗ
		|	&НомераУпаковок КАК НомераУпаковок
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерУпаковки,
		|	КлючУпаковки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезультатыПроверки.Документ                      КАК Документ,
		|	РезультатыПроверки.НомерУпаковки                 КАК НомерУпаковкиПроверки,
		|	РезультатыПроверки.КлючУпаковки                  КАК КлючУпаковкиПроверки,
		|	РезультатыПроверки.ДатаИзменения                 КАК ДатаИзменения
		|ИЗ
		|	РегистрСведений.РезультатыПроверкиКМРазрешительныйРежимМДЛП КАК РезультатыПроверки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|			НомераУпаковок КАК НомераУпаковок
		|		ПО
		|			НомераУпаковок.НомерУпаковки = РезультатыПроверки.НомерУпаковки
		|			И НомераУпаковок.КлючУпаковки = РезультатыПроверки.КлючУпаковки
		|");
		
		Запрос.УстановитьПараметр("НомераУпаковок", ТаблицаНомеровУпаковокИзМассива(НомераУпаковок));
		
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
		Оператор = СхемаЗапроса.ПакетЗапросов[1].Операторы[0];
		
	Иначе
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	РезультатыПроверки.Документ                      КАК Документ,
		|	РезультатыПроверки.НомерУпаковки                 КАК НомерУпаковкиПроверки,
		|	РезультатыПроверки.КлючУпаковки                  КАК КлючУпаковкиПроверки,
		|	РезультатыПроверки.ДатаИзменения                 КАК ДатаИзменения
		|ИЗ
		|	РегистрСведений.РезультатыПроверкиКМРазрешительныйРежимМДЛП КАК РезультатыПроверки
		|");
		
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
		Оператор = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
		
	КонецЕсли;
	
	Документ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Документ");
	Если ЗначениеЗаполнено(Документ) Тогда
		
		Запрос.УстановитьПараметр("Документ", Документ);
		
		Оператор.Отбор.Добавить("РезультатыПроверки.Документ = &Документ");
		
	КонецЕсли;
	
	СвойстваРезультата = СвойстваРезультатаПроверкиКМ();
	
	ВыбираемыеПоля = Оператор.ВыбираемыеПоля;
	Для Каждого ИмяСвойства Из СвойстваРезультата Цикл
		ВыбираемыеПоля.Добавить(ИмяСвойства);
	КонецЦикла;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	ВсеСвойстваРезультатаСтрокой = СтрСоединить(ВсеСвойстваРезультатаПроверкиКМ(), ",");
	ЗначенияПоУмолчаниюРезультата = РезультатПроверкиКМПоУмолчанию();
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Таблица.Колонки.Добавить("РезультатПроверкиКМ", Новый ОписаниеТипов());
	Для Каждого Строка Из Таблица Цикл
		
		РезультатПроверкиКМ = Новый Структура(ВсеСвойстваРезультатаСтрокой);
		ЗаполнитьЗначенияСвойств(РезультатПроверкиКМ, ЗначенияПоУмолчаниюРезультата);
		ЗаполнитьЗначенияСвойств(РезультатПроверкиКМ, Строка);
		
		ДетальныйРезультатПроверкиКМ = Строка.ДетальныйРезультатПроверкиКМ.Получить();
		Если ДетальныйРезультатПроверкиКМ <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(РезультатПроверкиКМ, ДетальныйРезультатПроверкиКМ);
		КонецЕсли;
		
		Строка.РезультатПроверкиКМ = Новый ФиксированнаяСтруктура(РезультатПроверкиКМ);
		
	КонецЦикла;
	
	Для Каждого ИмяСвойства Из СвойстваРезультата Цикл
		Таблица.Колонки.Удалить(ИмяСвойства);
	КонецЦикла;
	
	Таблица.Индексы.Добавить("НомерУпаковкиПроверки");
	
	Возврат Таблица;
	
КонецФункции

Функция СвойстваРезультатаПроверкиКМ() Экспорт
	
	Свойства = Новый Массив;
	
	Реквизиты = Метаданные.РегистрыСведений.РезультатыПроверкиКМРазрешительныйРежимМДЛП.Реквизиты;
	Для Каждого Реквизит Из Реквизиты Цикл
		Свойства.Добавить(Реквизит.Имя);
	КонецЦикла;
	
	Возврат Свойства;
	
КонецФункции

Функция ДетальныеСвойстваРезультатаПроверкиКМ() Экспорт
	
	Свойства = Новый Массив;
	
	Результаты = РазрешительныйРежимМДЛПКлиентСервер.НовыйРезультатЭлементаПроверкиКМНаКлиентеНаСервере();
	Для Каждого КлючИЗначение Из Результаты Цикл
		Свойства.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	
	Возврат Свойства;
	
КонецФункции

Функция ВсеСвойстваРезультатаПроверкиКМ() Экспорт
	
	ВсеСвойства = Новый Массив;
	
	СвойстваРезультатаПроверкиКМ = СвойстваРезультатаПроверкиКМ();
	УдаляемыйЭлемент = СвойстваРезультатаПроверкиКМ.Найти("ДетальныйРезультатПроверкиКМ");
	Если УдаляемыйЭлемент <> Неопределено Тогда
		СвойстваРезультатаПроверкиКМ.Удалить(УдаляемыйЭлемент);
	КонецЕсли;
	
	ДетальныеСвойстваРезультатаПроверкиКМ = ДетальныеСвойстваРезультатаПроверкиКМ();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСвойства, СвойстваРезультатаПроверкиКМ, Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСвойства, ДетальныеСвойстваРезультатаПроверкиКМ, Истина);
	
	Возврат ВсеСвойства;
	
КонецФункции

Функция РезультатПроверкиКМПоУмолчанию() Экспорт
	
	ВсеСвойстваРезультатаСтрокой = СтрСоединить(ВсеСвойстваРезультатаПроверкиКМ(), ",");
	Свойства = Новый Структура(ВсеСвойстваРезультатаСтрокой);
	
	ЗаполнитьЗначенияСвойств(Свойства, РазрешительныйРежимМДЛПКлиентСервер.НовыйРезультатЭлементаПроверкиКМНаКлиентеНаСервере());
	
	Возврат Свойства;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТаблицаНомеровУпаковокИзМассива(НомераУпаковок)
	
	ТаблицаНомеровУпаковок = Новый ТаблицаЗначений;
	ТаблицаНомеровУпаковок.Колонки.Добавить("НомерУпаковки", Метаданные.ОпределяемыеТипы.НомерУпаковкиМДЛП.Тип);
	ТаблицаНомеровУпаковок.Колонки.Добавить("КлючУпаковки", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	
	Для Каждого НомерУпаковки Из НомераУпаковок Цикл
		Строка = ТаблицаНомеровУпаковок.Добавить();
		Строка.НомерУпаковки = НомерУпаковки;
		Строка.КлючУпаковки = ИнтеграцияМДЛПКлиентСервер.ПолучитьКлючУпаковки(НомерУпаковки);
	КонецЦикла;
	
	Возврат ТаблицаНомеровУпаковок;
	
КонецФункции

#КонецОбласти

#КонецЕсли
